fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Выплаты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	Блокировка.Заблокировать();
	
	// 2. КОНТРОЛЬ ОСТАТКОВ
	СписокСотрудников = Выплаты.ВыгрузитьКолонку("Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ


		|	ВзаиморасчетыОстатки.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаОстаток, 0) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Бесконечность, Сотрудник В (&СписокСотрудников)) КАК ВзаиморасчетыОстатки";
	
	КонецВремен = Дата(3999, 12, 31, 23, 59, 59);
	Запрос.УстановитьПараметр("Бесконечность", Новый Граница(КонецВремен, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Индексы.Добавить("Сотрудник"); 
	
	Для Каждого СтрокаВыплаты Из Выплаты Цикл
		
		СтрокаОстатка = РезультатЗапроса.Найти(СтрокаВыплаты.Сотрудник, "Сотрудник");
		
		ТекущийДолг = 0;
		Если СтрокаОстатка <> Неопределено Тогда
			ТекущийДолг = СтрокаОстатка.Остаток;
		КонецЕсли;
		
		// ПРОВЕРКА: Теперь ТекущийДолг — это ЧИСТЫЙ долг без учета этого документа.
		Если СтрокаВыплаты.Сумма > ТекущийДолг Тогда
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'По сотруднику %1 превышена сумма выплаты! Доступно к выплате: %2, введено: %3'"), 
				СтрокаВыплаты.Сотрудник, ТекущийДолг, СтрокаВыплаты.Сумма);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"Выплаты[" + Выплаты.Индекс(СтрокаВыплаты) + "].Сумма",
				"Объект",
				Отказ);
		КонецЕсли;
		
	КонецЦикла;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// 3. ЗАПИСЬ НОВЫХ ДВИЖЕНИЙ
	Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	 
КонецПроцедуры

#КонецОбласти

#КонецЕсли
